feat(docs): add d2 pre-render support
